sentences.org
#+AUTHOR: Gu Feng
#+TITLE: IELTS SENTENCES
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/code-hide.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css" />
#+HTML: <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
#+OPTIONS: toc:1

*                                                                 :education:
** 从入学第一天起学生就要遵守校规 =On the first day a pupil enters school, he is asked to conform to the school rules.=
** 寄宿学校学生学会合作和互让,为以后成功培养人际交往能力 =In a boarding school, students learn to cooperate and compromise, and develop interpersonal skills needed for future successes.= #
** 取长补短 =learn from other's strong points and overcome our weakness=
** 盲目/机械地照做 =copy things blindly/mechanically= #
** 纪律不会扼杀天才而恰恰相反 =Discipline does not kill one's talent, quite the opposite in fact.= #
** 其实正相反,压力扼杀创造力 =On the contrary, I think pressure stifles creativity.=
** 消除误解 =correct misapprehension=
** 养育孩子 =bring up children=
** 出国留学开阔视野充实思想培养自立 =Overseas study broadens one's vision, enriches one's mind and cultivates independence.=
** 学生认为老师说的不对提出质疑 =Once students think what a teacher says is not correct, they defy him.=
** 远程教育和传统教育互补 =Tele-education and traditional classroom teaching complement each other.= :technology:
** 挑战权威 =challenge the authority=
** 学生应该专心学习,兼职可能会分散注意力 =A student should concentrate his/her attention on academic study and taking a part time job may divert his/her attention.=
** 大学生应该更关心公共事务 =College students should concern themselves more with public affairs.=
** 穿校服提高成绩应该普及 =School uniforms increase attendance and academic achievements, so the practice of wearing uniforms at school should be popularised.= #
** 父母烦恼与孩子游戏成瘾 =Parents are annoyed with children's addiction to computer games.= :technology:
** 年轻人学会花钱避免浪费 =Young people should learn to spend money carefully and avoid extravagance.= #
** 不可否认学校该禁烟 =It's undeniable that smoking should be banned in school.=
** 学术不端 =academic misconduct=
** 他表现勇敢 =He behaved with great courage.=
** 年轻人沉静其中而没有意识到他们有多努力 =The youngsters were so absorbed in it and did not realise how much they are exerting themselves.=
** 不要做无用功 =Do not exert yourself unnecessarily.=
** 应该教育儿童遵守法律 =Children should be taught to abide by the law.= :crime:
** 农村儿童没钱上学成文盲 =In rural areas, many children can't afford to go to school and become illiterates.=
** 沉溺电脑游戏严重影响学习 =Indulgence in computer game will affect one's academic performance seriously.= :technology:
** 为了吸引人们从事教育,专家主张提高工资 =In order to attract more people to take up teaching as their lifelong pursuit, some experts advocate higher salaries for teachers.= #
** 考生没通过考试不会被录取 =If a candidate fails in the IELTS test, he/she will not be admitted into a university in Australia.= #
** 老师不该因为家长的错误而责备孩子 =A teacher should not blame a child for his/her parents' fault.=
** 理论联系实际 =apply theory to practice=
** 有父母在国外的儿童在18岁时没有资格接受免费高等教育 =Children who attain the age of 18 whilst a parent is abroad will not be eligible for free higher education.=
** 克服坏习惯 =conquer/break/overcome bad habit=

*                                                               :environment:
** 为后代保护林地 =We must conserve our woodlands for future generations.=
** 粗放灌溉消耗宝贵水资源 =Extensive irrigation consumes our scarce freshwater resources.=
** 有效防范能够控制人口增长减轻环境压力 =Effective precautions can help the control population growth and alleviate environmental pressures= #
** 把耕地作为开发区的政策受到严厉批评被视为不环保 =The policies of turning tillable fields into development zones have been severely criticized and regarded as environmentally unfriendly/environment-unfriendly.= #
** 教育公民珍惜水不要浪费水资源 =Citizens should be educated to cherish every drop of water and never lavish our scarce freshwater resources.=
** 再次欠收将是农民的灾难 =It's would be a calamity for the farmers if the crops failed again.=
