sentences.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>IELTS SENTENCES</title>
<!-- 2014-10-17 Fri 00:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gu Feng" />
<link rel="stylesheet" type="text/css" href="css/code-hide.css" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">IELTS SENTENCES</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></a></li>
<li><a href="#sec-2">2. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="environment">environment</span></span></a></li>
<li><a href="#sec-3">3. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="health">health</span></span></a></li>
<li><a href="#sec-4">4. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="ethics">ethics</span></span></a></li>
<li><a href="#sec-5">5. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></a></li>
<li><a href="#sec-6">6. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="family">family</span></span></a></li>
<li><a href="#sec-7">7. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></a></li>
<li><a href="#sec-8">8. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="gender">gender</span></span></a></li>
<li><a href="#sec-9">9. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="animal">animal</span></span></a></li>
<li><a href="#sec-10">10. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></a></li>
<li><a href="#sec-11">11. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="media">media</span></span></a></li>
<li><a href="#sec-12">12. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="culture">culture</span></span></a></li>
<li><a href="#sec-13">13. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="government">government</span></span></a></li>
<li><a href="#sec-14">14. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="crime">crime</span></span></a></li>
<li><a href="#sec-15">15. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="development">development</span></span></a></li>
<li><a href="#sec-16">16. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="letter">letter</span></span></a></li>
<li><a href="#sec-17">17. &#xa0;&#xa0;&#xa0;<span class="tag"><span class="bonus">bonus</span></span></a></li>
<li><a href="#sec-18">18. Sleeping on the Job</a></li>
</ul>
</div>
</div>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 从入学第一天起学生就要遵守校规 <code>On the first day a pupil enters school, he is asked to conform to the school rules.</code></h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 寄宿学校学生学会合作和互让,为以后成功培养人际交往能力 <code>In a boarding school, students learn to cooperate and compromise, and develop interpersonal skills needed for future successes.</code> #</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 取长补短 <code>learn from other's strong points and overcome our weakness</code></h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 盲目/机械地照做 <code>copy things blindly/mechanically</code> #</h3>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 纪律不会扼杀天才而恰恰相反 <code>Discipline does not kill one's talent, quite the opposite in fact.</code> #</h3>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 其实正相反,压力扼杀创造力 <code>On the contrary, I think pressure stifles creativity.</code></h3>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 消除误解 <code>correct misapprehension</code></h3>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 养育孩子 <code>bring up children</code></h3>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 出国留学开阔视野充实思想培养自立 <code>Overseas study broadens one's vision, enriches one's mind and cultivates independence.</code></h3>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 学生认为老师说的不对提出质疑 <code>Once students think what a teacher says is not correct, they defy him.</code></h3>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> 远程教育和传统教育互补 <code>Tele-education and traditional classroom teaching complement each other.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> 挑战权威 <code>challenge the authority</code></h3>
</div>
<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> 学生应该专心学习,兼职可能会分散注意力 <code>A student should concentrate his/her attention on academic study and taking a part time job may divert his/her attention.</code></h3>
</div>
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> 大学生应该更关心公共事务 <code>College students should concern themselves more with public affairs.</code></h3>
</div>
<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> 穿校服提高成绩应该普及 <code>School uniforms increase attendance and academic achievements, so the practice of wearing uniforms at school should be popularised.</code> #</h3>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> 父母烦恼与孩子游戏成瘾 <code>Parents are annoyed with children's addiction to computer games.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> 年轻人学会花钱避免浪费 <code>Young people should learn to spend money carefully and avoid extravagance.</code> #</h3>
</div>
<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> 不可否认学校该禁烟 <code>It's undeniable that smoking should be banned in school.</code></h3>
</div>
<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> 学术不端 <code>academic misconduct</code></h3>
</div>
<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> 他表现勇敢 <code>He behaved with great courage.</code></h3>
</div>
<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> 年轻人沉静其中而没有意识到他们有多努力 <code>The youngsters were so absorbed in it and did not realise how much they are exerting themselves.</code></h3>
</div>
<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> 不要做无用功 <code>Do not exert yourself unnecessarily.</code></h3>
</div>
<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> 应该教育儿童遵守法律 <code>Children should be taught to abide by the law.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crime">crime</span></span></h3>
</div>
<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="section-number-3">1.24</span> 农村儿童没钱上学成文盲 <code>In rural areas, many children can't afford to go to school and become illiterates.</code></h3>
</div>
<div id="outline-container-sec-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="section-number-3">1.25</span> 沉溺电脑游戏严重影响学习 <code>Indulgence in computer game will affect one's academic performance seriously.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="section-number-3">1.26</span> 为了吸引人们从事教育,专家主张提高工资 <code>In order to attract more people to take up teaching as their lifelong pursuit, some experts advocate higher salaries for teachers.</code> #</h3>
</div>
<div id="outline-container-sec-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="section-number-3">1.27</span> 考生没通过考试不会被录取 <code>If a candidate fails in the IELTS test, he/she will not be admitted into a university in Australia.</code> #</h3>
</div>
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="section-number-3">1.28</span> 老师不该因为家长的错误而责备孩子 <code>A teacher should not blame a child for his/her parents' fault.</code></h3>
</div>
<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="section-number-3">1.29</span> 理论联系实际 <code>apply theory to practice</code></h3>
</div>
<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="section-number-3">1.30</span> 有父母在国外的儿童在18岁时没有资格接受免费高等教育 <code>Children who attain the age of 18 whilst a parent is abroad will not be eligible for free higher education.</code></h3>
</div>
<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="section-number-3">1.31</span> 克服坏习惯 <code>conquer/break/overcome bad habit</code></h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="environment">environment</span></span></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 为后代保护林地 <code>We must conserve our woodlands for future generations.</code></h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 粗放灌溉消耗宝贵水资源 <code>Extensive irrigation consumes our scarce freshwater resources.</code></h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 有效防范能够控制人口增长减轻环境压力 <code>Effective precautions can help the control population growth and alleviate environmental pressures</code> #</h3>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 把耕地作为开发区的政策受到严厉批评被视为不环保 <code>The policies of turning tillable fields into development zones have been severely criticized and regarded as environmentally unfriendly/environment-unfriendly.</code> #</h3>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 教育公民珍惜水不要浪费水资源 <code>Citizens should be educated to cherish every drop of water and never lavish our scarce freshwater resources.</code></h3>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 再次欠收将是农民的灾难 <code>It's would be a calamity for the farmers if the crops failed again.</code></h3>
</div>
