sentences.org
** 酸雨激发环保意识 =Acid rain arouses people's awareness of environmental protection.=
** 沙漠化损失估计上百万 =Damage caused by desertification was assessed at millions of dollars.=
** 政府努力实现资源可持续发展 =Governments should endeavour to achieve sustainable development of resources.=
** 砍伐森林导致动物灭亡 =The deforestation will drive animals without the adaptability to new surroundings into mass extinction.= :animal:
** 生态系统崩溃 =breakdown of the ecosystem=
** 酸雨迫使人们呆在屋里 =Acid rain compels people to stay indoors.=
** 含有污染物 =contain contaminants=

*                                                                    :health:
** 食荤者为了营养吃肉 =As for proponents of meat eating, absorption of nourishment is the major reason for them to have meat.= # :animal:ethics:
** 身体垮掉 =Overwork may finally lead to breakdown in heath.=
** 无数研究证明吸烟有害健康 =Numerous research and studies confirm the theory that smoking does harm to health.=
** 现代医学攻克很多疾病 =Modern medical science has conquered many diseases.= :technology:
** 快餐吃多了有害身体 =Eating too much fast food is physically damaging, for fast foods contain to much sugar, fat and calories.=
** 过分沉溺于电脑游戏导致近视,肥胖和重复性损伤 =Overindulgence in computer games contributes to myopia, obesity and repetitive stress injuries.=
** 过早地处于亚健康状态 =be in the state of sub-health prematurely=
** 身患绝症 =suffering incurable/terminal disease=
** 克隆技术帮助治愈遗传疾病使人们过上健康生活 =The cloning technology would help scientists to cure genetic diseases and also other diseases so that people can live longer healthy lives.= :technology:
** 微恙 =trifling ailment=
** 以肉奶为主的饮食习惯会引发各种慢性病和生理失调 =Meat and dairy centred diets are linked to many types of cancers, as well as chronic diseases such as heart ailments, diabetes, obesity, gallbladder diseases, hypertension, and more deadly diseases and psychological disorder.=
** 充分意识到健康重要性,城市居民喜欢有氧运动 =Fully aware of the importance of health, many city dwellers adore aerobic exercise.=
** 要长寿建议养成健康饮食和锻炼习惯 =To enjoy a longer lifespan, it is advisable for us adopt and maintain healthy patterns of diet and exercise.=
** 压力扰乱免疫系统 =pressure disorder our immune system=              :work:
** 白领调整生活方式保持健康 =White-collar workers should adjust their lifestyle in order to stay healthy.= :work:

*                                                                    :ethics:
** 计划生育无可厚非 =China's family planning policy is above/beyond reproach.=
** 科学家谴责克隆人因为有悖伦理道德 =Many scientists condemn cloning human beings for it is morally and ethically wrong.= :technology:
** 正反意见抵消 =The pros and cons cancel out.=
** 令人震惊,无法容忍 =outrageous and intolerable=
** 受责任心,道德约束或至少法律的制约 =Manufactures should be subject to the sense of responsibility, moral obligation or at least the law.= #
** 随着第一只克隆羊的出现人类克隆违法自然的讨论加剧 =The discussion on whether the human race can go against nature by cloning themselves has heated with the advent of the first cloned sheep Dolly.= :technology:
** 废除死刑的争论 =There arises a heated debate on whether capital punishment should be abolished.=
** 在我背后说闲话让人恼火 =It vexed me to think of others gossiping behind my back.=
** 光阴一去不复返 =Nothing can compensate for the loss of time.=
** 为暴行赎罪 =The invaders must atone for atrocities they committed.=
** 运动员服用禁药并不少见 =Abuse of performance-enhancing drugs is not uncommon among athletes.= #
** 不充分讨论利弊无法评估毒品合法化必要性 =It's hard to make assessment on the necessity of drug legalisation if merits and demerits are not fully discussed.= :crime:
** 怀疑论者将其归因于生活的不公 =A sceptic may put it down to life inequalities.=
** 轻率的，无知的，懒惰的，只看事情表面的结果而不是事情本身，就会归功于运气、命运、和巧合 =The thoughtless, the ignorant, and the indolent, seeing only the apparent effects of things and not the things themselves, talk of luck, of fortune, and chance.=
*                                                                      :work:
** 开放办公环境使员工自由交流 =An open office environment makes workers communicate directly and freely.=
** 不接触同事不了解公司状况阻碍职业发展 =The lack of daily contact with coworkers could take us out of the loop relative to what is going on within the company. This lack of inside knowledge could affect our advancement within the company.=
** 人际关系紧张,工作压力大,竞争激烈导致白领精神崩溃 =Tense human relationships, heavy pressure from work and life and fierce competition contribute to many white-collar workers' nervous breakdown.= # :health:
** 勤劳简朴适应于一切事业 =The principle of diligence and frugality applies to all undertakings.=
** 过去几年在跨国公司积累丰富经验 =In the past few year, I've been working for a famous multinational and therefor attained fair knowledge and rich experience in this field.=
** 适应规范 =adapt to norms=
