sentences.html
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 酸雨激发环保意识 <code>Acid rain arouses people's awareness of environmental protection.</code></h3>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 沙漠化损失估计上百万 <code>Damage caused by desertification was assessed at millions of dollars.</code></h3>
</div>
<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 政府努力实现资源可持续发展 <code>Governments should endeavour to achieve sustainable development of resources.</code></h3>
</div>
<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> 砍伐森林导致动物灭亡 <code>The deforestation will drive animals without the adaptability to new surroundings into mass extinction.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="animal">animal</span></span></h3>
</div>
<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> 生态系统崩溃 <code>breakdown of the ecosystem</code></h3>
</div>
<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> 酸雨迫使人们呆在屋里 <code>Acid rain compels people to stay indoors.</code></h3>
</div>
<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> 含有污染物 <code>contain contaminants</code></h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="health">health</span></span></h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 食荤者为了营养吃肉 <code>As for proponents of meat eating, absorption of nourishment is the major reason for them to have meat.</code> #&#xa0;&#xa0;&#xa0;<span class="tag"><span class="animal">animal</span>&#xa0;<span class="ethics">ethics</span></span></h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 身体垮掉 <code>Overwork may finally lead to breakdown in heath.</code></h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 无数研究证明吸烟有害健康 <code>Numerous research and studies confirm the theory that smoking does harm to health.</code></h3>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 现代医学攻克很多疾病 <code>Modern medical science has conquered many diseases.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 快餐吃多了有害身体 <code>Eating too much fast food is physically damaging, for fast foods contain to much sugar, fat and calories.</code></h3>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 过分沉溺于电脑游戏导致近视,肥胖和重复性损伤 <code>Overindulgence in computer games contributes to myopia, obesity and repetitive stress injuries.</code></h3>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 过早地处于亚健康状态 <code>be in the state of sub-health prematurely</code></h3>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 身患绝症 <code>suffering incurable/terminal disease</code></h3>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 克隆技术帮助治愈遗传疾病使人们过上健康生活 <code>The cloning technology would help scientists to cure genetic diseases and also other diseases so that people can live longer healthy lives.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> 微恙 <code>trifling ailment</code></h3>
</div>
<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> 以肉奶为主的饮食习惯会引发各种慢性病和生理失调 <code>Meat and dairy centred diets are linked to many types of cancers, as well as chronic diseases such as heart ailments, diabetes, obesity, gallbladder diseases, hypertension, and more deadly diseases and psychological disorder.</code></h3>
</div>
<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> 充分意识到健康重要性,城市居民喜欢有氧运动 <code>Fully aware of the importance of health, many city dwellers adore aerobic exercise.</code></h3>
</div>
<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> 要长寿建议养成健康饮食和锻炼习惯 <code>To enjoy a longer lifespan, it is advisable for us adopt and maintain healthy patterns of diet and exercise.</code></h3>
</div>
<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> 压力扰乱免疫系统 <code>pressure disorder our immune system</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></h3>
</div>
<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> 白领调整生活方式保持健康 <code>White-collar workers should adjust their lifestyle in order to stay healthy.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="ethics">ethics</span></span></h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 计划生育无可厚非 <code>China's family planning policy is above/beyond reproach.</code></h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 科学家谴责克隆人因为有悖伦理道德 <code>Many scientists condemn cloning human beings for it is morally and ethically wrong.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 正反意见抵消 <code>The pros and cons cancel out.</code></h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 令人震惊,无法容忍 <code>outrageous and intolerable</code></h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 受责任心,道德约束或至少法律的制约 <code>Manufactures should be subject to the sense of responsibility, moral obligation or at least the law.</code> #</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 随着第一只克隆羊的出现人类克隆违法自然的讨论加剧 <code>The discussion on whether the human race can go against nature by cloning themselves has heated with the advent of the first cloned sheep Dolly.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h3>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> 废除死刑的争论 <code>There arises a heated debate on whether capital punishment should be abolished.</code></h3>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> 在我背后说闲话让人恼火 <code>It vexed me to think of others gossiping behind my back.</code></h3>
</div>
<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> 光阴一去不复返 <code>Nothing can compensate for the loss of time.</code></h3>
</div>
<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> 为暴行赎罪 <code>The invaders must atone for atrocities they committed.</code></h3>
</div>
<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="section-number-3">4.11</span> 运动员服用禁药并不少见 <code>Abuse of performance-enhancing drugs is not uncommon among athletes.</code> #</h3>
</div>
<div id="outline-container-sec-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="section-number-3">4.12</span> 不充分讨论利弊无法评估毒品合法化必要性 <code>It's hard to make assessment on the necessity of drug legalisation if merits and demerits are not fully discussed.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crime">crime</span></span></h3>
</div>
<div id="outline-container-sec-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="section-number-3">4.13</span> 怀疑论者将其归因于生活的不公 <code>A sceptic may put it down to life inequalities.</code></h3>
</div>
<div id="outline-container-sec-4-14" class="outline-3">
<h3 id="sec-4-14"><span class="section-number-3">4.14</span> 轻率的，无知的，懒惰的，只看事情表面的结果而不是事情本身，就会归功于运气、命运、和巧合 <code>The thoughtless, the ignorant, and the indolent, seeing only the apparent effects of things and not the things themselves, talk of luck, of fortune, and chance.</code></h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 开放办公环境使员工自由交流 <code>An open office environment makes workers communicate directly and freely.</code></h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 不接触同事不了解公司状况阻碍职业发展 <code>The lack of daily contact with coworkers could take us out of the loop relative to what is going on within the company. This lack of inside knowledge could affect our advancement within the company.</code></h3>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 人际关系紧张,工作压力大,竞争激烈导致白领精神崩溃 <code>Tense human relationships, heavy pressure from work and life and fierce competition contribute to many white-collar workers' nervous breakdown.</code> #&#xa0;&#xa0;&#xa0;<span class="tag"><span class="health">health</span></span></h3>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 勤劳简朴适应于一切事业 <code>The principle of diligence and frugality applies to all undertakings.</code></h3>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 过去几年在跨国公司积累丰富经验 <code>In the past few year, I've been working for a famous multinational and therefor attained fair knowledge and rich experience in this field.</code></h3>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 适应规范 <code>adapt to norms</code></h3>
</div>
