sentences.org
** 能够适应世界变化对个人很重要 =Learning to adapt to the changing world is of great significance to a person.= #
** 嘴上说说却从不付诸行动 =He always purport to do something but never act out.=
** 竞争激烈白领自杀数上升 =The number of white-collar workers who commit suicide increases with the increasingly intensive social competition.= :health:

*                                                                    :family:
** 夫妻间感性和理性需求与维持婚姻本身相比是次要的 =The emotional and intellectual needs of spouses are secondary to the survival of the marriage itself.=
** 宣布你们结为夫妻 =I now pronounce you husband and wife.= #
** 这个缺点抵消了本来还算开明的态度 =The weakness negates his otherwise progressive attitude.=
** 成功的婚姻归因于魅力,奉献和耐心 =A successful marriage can be ascribed to attraction, devotion and patience.=

*                                                                      :life:
** 业余爱好 =Leisure time pursuits influence one's thought-habit.=
** 期待广州之行愉快 =We anticipate great pleasure from our visit to Guangzhou.=
** 一部充满恐怖暴力但却引人入胜的电影 =a frighteningly violent yet compelling film=

*                                                                    :gender:
** 体力劳动几乎全部有男性完成 =Manual labour has been performed almost exclusively by men.=
** 最佳生育年龄 =prime child-bearing age=                              :work:
** 职业女性很难平衡工作和家庭 =Many career women find it really hard to balance work and family life.=

*                                                                    :animal:
** 熊猫和秃鹰被列为濒危物种 =Pandas and bald eagles are classified as endangered species.= #
** 邻居家养宠物的人们总是埋怨睡觉被吵醒 =People whose neighbours have pets always complain that their sleep is interrupted at midnight by the pets' noises.= :family:
** 与宠物的积极关系有助于建立与他人的信任 =Positive relationships with pets can be an aid in the development of trusting relationships with others.=
** 中国越来越多人加入到保护珍稀动物的运动 =More and more people in China have entered the campaign to save rare animals from extinction.=
** 动物保护人士反对为了人类利益虐待动物 =Animal activists assert their opposition to the fact that animals are abused for man's interests.=
** 虐待动物不道德 =It's unethical and barbaric to abuse animals.=

*                                                                :technology:
** 工序由电脑控制 =The process are all electronically controlled.= #
** 因特网是传播信息的便捷途径 =The Internet is a convenient way to convey information.= #
** 依靠无线技术发达国家实现远程教育 =Based on wireless technology, developed countries have realised the breakthrough of providing long distance education for children in remote areas.= :education:
** 互联网加速信息传播 =The advent of the Internet has accelerated the flow of information.=
** 宇航员圆满完成任务 =The astronaut has accomplished the mission successfully.=
** 成年人需要学习电脑 =With the application of computers, many adults feel the pressing need of acquiring computer literacy.=

*                                                                     :media:
** 代言系列美容产品 =The movie star endorses a line of cosmetic products.=

*                                                                   :culture:
** 人们年轻时开放年纪大后保守 =People tend to be more liberal when they are young and become more conservative as they get older.=
** 发展得当的话旅游业与保护古建筑不矛盾 =Carried out in the right way, tourism may not conflict with the conservation of historic buildings.=
** 文化遗产属于全人类 =Cultural heritage belongs to all human beings.=
** 封建迷信尽早废除,毒害人心 =The abolishment of superstitious practices and customs should be carried out as soon as possible since they may poison people's mind.= #
** 图书馆丰富的历史文化书籍能让市民了解国家的过去 =The abundance of historical and cultural books in libraries enables citizens to have an understanding of the countries' past.=
** 市民免费使用图书馆获得信息 =Citizens should have free access to the library so that they may get contact with the latest information.=
** 奥运会开幕被用于宣传 =The opening ceremonies of the Olympic Games are now used to publicise the host countries' accomplishment and reveal the countries' connotation.= #
** 老房子有魅力 =This old building has a lot of atmosphere.=
** 市政府应立项资助传统艺术家以弘扬独特本土文化 =The municipal government should approve a scheme which aims to subsidize traditional artists so as to carry forward our unique indigenous culture.= #
** 政府应筹划项目以挽救濒危语言 =The government should arrange for special programmes to save endangered languages.= :government:
** 语言学家有责任保护濒危语言 =Linguists assume new duties of storing as much information as possible about extinct languages.=
** 鼓励原住民坚持传统 =Aboriginals should be encouraged to adhere to their cultural traditions.=
** 我们永远不能放弃民族特性 =We shall never abandon our national identity.=
