sentences.html
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> 能够适应世界变化对个人很重要 <code>Learning to adapt to the changing world is of great significance to a person.</code> #</h3>
</div>
<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> 嘴上说说却从不付诸行动 <code>He always purport to do something but never act out.</code></h3>
</div>
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> 竞争激烈白领自杀数上升 <code>The number of white-collar workers who commit suicide increases with the increasingly intensive social competition.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="health">health</span></span></h3>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="family">family</span></span></h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 夫妻间感性和理性需求与维持婚姻本身相比是次要的 <code>The emotional and intellectual needs of spouses are secondary to the survival of the marriage itself.</code></h3>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 宣布你们结为夫妻 <code>I now pronounce you husband and wife.</code> #</h3>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 这个缺点抵消了本来还算开明的态度 <code>The weakness negates his otherwise progressive attitude.</code></h3>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 成功的婚姻归因于魅力,奉献和耐心 <code>A successful marriage can be ascribed to attraction, devotion and patience.</code></h3>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 业余爱好 <code>Leisure time pursuits influence one's thought-habit.</code></h3>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 期待广州之行愉快 <code>We anticipate great pleasure from our visit to Guangzhou.</code></h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 一部充满恐怖暴力但却引人入胜的电影 <code>a frighteningly violent yet compelling film</code></h3>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="gender">gender</span></span></h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 体力劳动几乎全部有男性完成 <code>Manual labour has been performed almost exclusively by men.</code></h3>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 最佳生育年龄 <code>prime child-bearing age</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></h3>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 职业女性很难平衡工作和家庭 <code>Many career women find it really hard to balance work and family life.</code></h3>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="animal">animal</span></span></h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 熊猫和秃鹰被列为濒危物种 <code>Pandas and bald eagles are classified as endangered species.</code> #</h3>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 邻居家养宠物的人们总是埋怨睡觉被吵醒 <code>People whose neighbours have pets always complain that their sleep is interrupted at midnight by the pets' noises.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="family">family</span></span></h3>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 与宠物的积极关系有助于建立与他人的信任 <code>Positive relationships with pets can be an aid in the development of trusting relationships with others.</code></h3>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 中国越来越多人加入到保护珍稀动物的运动 <code>More and more people in China have entered the campaign to save rare animals from extinction.</code></h3>
</div>
<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> 动物保护人士反对为了人类利益虐待动物 <code>Animal activists assert their opposition to the fact that animals are abused for man's interests.</code></h3>
</div>
<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> 虐待动物不道德 <code>It's unethical and barbaric to abuse animals.</code></h3>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="technology">technology</span></span></h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 工序由电脑控制 <code>The process are all electronically controlled.</code> #</h3>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 因特网是传播信息的便捷途径 <code>The Internet is a convenient way to convey information.</code> #</h3>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 依靠无线技术发达国家实现远程教育 <code>Based on wireless technology, developed countries have realised the breakthrough of providing long distance education for children in remote areas.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h3>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 互联网加速信息传播 <code>The advent of the Internet has accelerated the flow of information.</code></h3>
</div>
<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> 宇航员圆满完成任务 <code>The astronaut has accomplished the mission successfully.</code></h3>
</div>
<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> 成年人需要学习电脑 <code>With the application of computers, many adults feel the pressing need of acquiring computer literacy.</code></h3>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="media">media</span></span></h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 代言系列美容产品 <code>The movie star endorses a line of cosmetic products.</code></h3>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="culture">culture</span></span></h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 人们年轻时开放年纪大后保守 <code>People tend to be more liberal when they are young and become more conservative as they get older.</code></h3>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 发展得当的话旅游业与保护古建筑不矛盾 <code>Carried out in the right way, tourism may not conflict with the conservation of historic buildings.</code></h3>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> 文化遗产属于全人类 <code>Cultural heritage belongs to all human beings.</code></h3>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> 封建迷信尽早废除,毒害人心 <code>The abolishment of superstitious practices and customs should be carried out as soon as possible since they may poison people's mind.</code> #</h3>
</div>
<div id="outline-container-sec-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> 图书馆丰富的历史文化书籍能让市民了解国家的过去 <code>The abundance of historical and cultural books in libraries enables citizens to have an understanding of the countries' past.</code></h3>
</div>
<div id="outline-container-sec-12-6" class="outline-3">
<h3 id="sec-12-6"><span class="section-number-3">12.6</span> 市民免费使用图书馆获得信息 <code>Citizens should have free access to the library so that they may get contact with the latest information.</code></h3>
</div>
<div id="outline-container-sec-12-7" class="outline-3">
<h3 id="sec-12-7"><span class="section-number-3">12.7</span> 奥运会开幕被用于宣传 <code>The opening ceremonies of the Olympic Games are now used to publicise the host countries' accomplishment and reveal the countries' connotation.</code> #</h3>
</div>
<div id="outline-container-sec-12-8" class="outline-3">
<h3 id="sec-12-8"><span class="section-number-3">12.8</span> 老房子有魅力 <code>This old building has a lot of atmosphere.</code></h3>
</div>
<div id="outline-container-sec-12-9" class="outline-3">
<h3 id="sec-12-9"><span class="section-number-3">12.9</span> 市政府应立项资助传统艺术家以弘扬独特本土文化 <code>The municipal government should approve a scheme which aims to subsidize traditional artists so as to carry forward our unique indigenous culture.</code> #</h3>
</div>
<div id="outline-container-sec-12-10" class="outline-3">
<h3 id="sec-12-10"><span class="section-number-3">12.10</span> 政府应筹划项目以挽救濒危语言 <code>The government should arrange for special programmes to save endangered languages.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="government">government</span></span></h3>
</div>
<div id="outline-container-sec-12-11" class="outline-3">
<h3 id="sec-12-11"><span class="section-number-3">12.11</span> 语言学家有责任保护濒危语言 <code>Linguists assume new duties of storing as much information as possible about extinct languages.</code></h3>
</div>
<div id="outline-container-sec-12-12" class="outline-3">
<h3 id="sec-12-12"><span class="section-number-3">12.12</span> 鼓励原住民坚持传统 <code>Aboriginals should be encouraged to adhere to their cultural traditions.</code></h3>
</div>
<div id="outline-container-sec-12-13" class="outline-3">
<h3 id="sec-12-13"><span class="section-number-3">12.13</span> 我们永远不能放弃民族特性 <code>We shall never abandon our national identity.</code></h3>
</div>
