sentences.org
** 保护文化遗产,去糟取精 =The best way to protect our cultural heritage is to absorb the essence and discard the dregs.=
** 求同存异 =to seek common ground while reserving differences=
** 这篇文章除了长之外没什么不好 =The article is long, but not otherwise blameworthy.=
** 移民融入社区 =Immigrants try to assimilate into the community.=
** 欣赏不同文化 =appreciate a difference culture=
** 开阔视野 =broaden one's horizon=
** 扩大知识面 =broaden one's scope of knowledge=
** 开阔眼界 =broaden one's vision=
** 旅行开阔心智 =Traveling broadens the mind.= #

*                                                                :government:
** 过度消费导致严重赤字 =Excessive consumption resulted in heavy trade deficit.=
** 分配给公共教育的资金不该被滥用 =Funds allocated for public education should not be misused.= :education:
** 为无家可归者提供食宿 =afford food and beds for the homeless=      :ethics:
** 有争议的政策引来国际批评 =The controversial policy have attracted international censure.=
** 政府需要关注老年人需求多建养老院 =The government should attend to the needs of the elderly and more nursing homes should be established.= :development:
** 对零售商强制罚款 =Fines are imposed on retailers.=
** 解决办法就在政府手中 =The remedy lies in the hands of the government.=
** 卫生部门解决城市垃圾问题 =The health authority should take proper measures to deal with the increasingly serious rubbish problem in urban areas.=

*                                                                     :crime:
** 持续暴力使谈判进程减速 =Continuing violence will retard the negotiations over the country's future.=
** 他拒绝透露关于那个人的任何消息 =He refused to divulge any information related to/regarding/concerning/involving the man's whereabouts.=
** 谴责侵略,请求宽容 =denounce the invasion and plead for tolerance= #
** 青少年犯罪值得关注 =Juvenile delinquency is one of the several matters that claims the public attention.= :education:
** 被迫认罪 =Sometimes one might be coerced into pleading guilty.=
** 青少年吸毒归咎于无知和好奇 =We often attribute youth drug abuse to ignorance and curiosity.= :education:

*                                                               :development:
** 没有公司更够承担中国为敌的后果 =No company can afford to antagonize China.=
** 发展中国家与发达国家竞争世界市场 =Developing countries have to compete with developed countries for the world market.=
** 股票价格剧烈变动 =The stock price altered sharply.=

** 汽车自行车停路边严重阻碍交通 =Cars and bikes parked along the streets block the flow of traffic, sometimes leading to serious traffic congestion.= #
** 街道难容私家车 =The narrow streets can hardly accommodate the increasingly large number of private cars.=
** 控制平民获得武器途径 =control the flow of guns to general populace=
** 经济保持缓慢发展 =The economy remains sluggish.=
*                                                                    :letter:
** 感谢你发的培训小册子 =I shall appreciate it if you could send me some relevant booklets regarding the training programme.=

*                                                                     :bonus:
** sue complain grumble whine mutter murmur
** is secondary to
** but otherwise
** not uncommon
** ineffective half-measures
** if it were not for
** in fact quite the oppsite
* Sleeping on the Job
http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work
Sleeping on the job boosts productivity.
Siestas company policy.
Daytime drowsiness can affect mood, productivity, and creativity, but a brief nap may provide greater alertness for several hours to help improve attention, concentration and accuracy.
Napping perk.
Cardiovascular disease and depression.
Sleep-deprived workers.
Stretching out.
Dozing in your cubicle.
Fool passersby into thinking you’re hard at work.
Drool on your report.
Our inner body clocks start to make us feel drowsy around siesta time—or somewhere between 1 and 4 p.m.—so aim to fit in a nap during these hours.
Make quick naps a daily ritual.
Get into the sleep mindset.
Doze off.
Snooze.
Catnaps.
Avoid snoozing too long and waking up groggy.
Longer naps have the downside of greater sleep inertia.
Set your cell phone or another device to go off after about 15 minutes.
You’ll feel recharged enough to tackle your afternoon agenda and still hit the gym after work.
