sentences.html
<div id="outline-container-sec-12-14" class="outline-3">
<h3 id="sec-12-14"><span class="section-number-3">12.14</span> 保护文化遗产,去糟取精 <code>The best way to protect our cultural heritage is to absorb the essence and discard the dregs.</code></h3>
</div>
<div id="outline-container-sec-12-15" class="outline-3">
<h3 id="sec-12-15"><span class="section-number-3">12.15</span> 求同存异 <code>to seek common ground while reserving differences</code></h3>
</div>
<div id="outline-container-sec-12-16" class="outline-3">
<h3 id="sec-12-16"><span class="section-number-3">12.16</span> 这篇文章除了长之外没什么不好 <code>The article is long, but not otherwise blameworthy.</code></h3>
</div>
<div id="outline-container-sec-12-17" class="outline-3">
<h3 id="sec-12-17"><span class="section-number-3">12.17</span> 移民融入社区 <code>Immigrants try to assimilate into the community.</code></h3>
</div>
<div id="outline-container-sec-12-18" class="outline-3">
<h3 id="sec-12-18"><span class="section-number-3">12.18</span> 欣赏不同文化 <code>appreciate a difference culture</code></h3>
</div>
<div id="outline-container-sec-12-19" class="outline-3">
<h3 id="sec-12-19"><span class="section-number-3">12.19</span> 开阔视野 <code>broaden one's horizon</code></h3>
</div>
<div id="outline-container-sec-12-20" class="outline-3">
<h3 id="sec-12-20"><span class="section-number-3">12.20</span> 扩大知识面 <code>broaden one's scope of knowledge</code></h3>
</div>
<div id="outline-container-sec-12-21" class="outline-3">
<h3 id="sec-12-21"><span class="section-number-3">12.21</span> 开阔眼界 <code>broaden one's vision</code></h3>
</div>
<div id="outline-container-sec-12-22" class="outline-3">
<h3 id="sec-12-22"><span class="section-number-3">12.22</span> 旅行开阔心智 <code>Traveling broadens the mind.</code> #</h3>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="government">government</span></span></h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> 过度消费导致严重赤字 <code>Excessive consumption resulted in heavy trade deficit.</code></h3>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> 分配给公共教育的资金不该被滥用 <code>Funds allocated for public education should not be misused.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h3>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> 为无家可归者提供食宿 <code>afford food and beds for the homeless</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ethics">ethics</span></span></h3>
</div>
<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> 有争议的政策引来国际批评 <code>The controversial policy have attracted international censure.</code></h3>
</div>
<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> 政府需要关注老年人需求多建养老院 <code>The government should attend to the needs of the elderly and more nursing homes should be established.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="development">development</span></span></h3>
</div>
<div id="outline-container-sec-13-6" class="outline-3">
<h3 id="sec-13-6"><span class="section-number-3">13.6</span> 对零售商强制罚款 <code>Fines are imposed on retailers.</code></h3>
</div>
<div id="outline-container-sec-13-7" class="outline-3">
<h3 id="sec-13-7"><span class="section-number-3">13.7</span> 解决办法就在政府手中 <code>The remedy lies in the hands of the government.</code></h3>
</div>
<div id="outline-container-sec-13-8" class="outline-3">
<h3 id="sec-13-8"><span class="section-number-3">13.8</span> 卫生部门解决城市垃圾问题 <code>The health authority should take proper measures to deal with the increasingly serious rubbish problem in urban areas.</code></h3>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="crime">crime</span></span></h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> 持续暴力使谈判进程减速 <code>Continuing violence will retard the negotiations over the country's future.</code></h3>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> 他拒绝透露关于那个人的任何消息 <code>He refused to divulge any information related to/regarding/concerning/involving the man's whereabouts.</code></h3>
</div>
<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> 谴责侵略,请求宽容 <code>denounce the invasion and plead for tolerance</code> #</h3>
</div>
<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4"><span class="section-number-3">14.4</span> 青少年犯罪值得关注 <code>Juvenile delinquency is one of the several matters that claims the public attention.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h3>
</div>
<div id="outline-container-sec-14-5" class="outline-3">
<h3 id="sec-14-5"><span class="section-number-3">14.5</span> 被迫认罪 <code>Sometimes one might be coerced into pleading guilty.</code></h3>
</div>
<div id="outline-container-sec-14-6" class="outline-3">
<h3 id="sec-14-6"><span class="section-number-3">14.6</span> 青少年吸毒归咎于无知和好奇 <code>We often attribute youth drug abuse to ignorance and curiosity.</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h3>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="development">development</span></span></h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> 没有公司更够承担中国为敌的后果 <code>No company can afford to antagonize China.</code></h3>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> 发展中国家与发达国家竞争世界市场 <code>Developing countries have to compete with developed countries for the world market.</code></h3>
</div>
<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> 股票价格剧烈变动 <code>The stock price altered sharply.</code></h3>
</div>

<div id="outline-container-sec-15-4" class="outline-3">
<h3 id="sec-15-4"><span class="section-number-3">15.4</span> 汽车自行车停路边严重阻碍交通 <code>Cars and bikes parked along the streets block the flow of traffic, sometimes leading to serious traffic congestion.</code> #</h3>
</div>
<div id="outline-container-sec-15-5" class="outline-3">
<h3 id="sec-15-5"><span class="section-number-3">15.5</span> 街道难容私家车 <code>The narrow streets can hardly accommodate the increasingly large number of private cars.</code></h3>
</div>
<div id="outline-container-sec-15-6" class="outline-3">
<h3 id="sec-15-6"><span class="section-number-3">15.6</span> 控制平民获得武器途径 <code>control the flow of guns to general populace</code></h3>
</div>
<div id="outline-container-sec-15-7" class="outline-3">
<h3 id="sec-15-7"><span class="section-number-3">15.7</span> 经济保持缓慢发展 <code>The economy remains sluggish.</code></h3>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="letter">letter</span></span></h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> 感谢你发的培训小册子 <code>I shall appreciate it if you could send me some relevant booklets regarding the training programme.</code></h3>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> &#xa0;&#xa0;&#xa0;<span class="tag"><span class="bonus">bonus</span></span></h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> sue complain grumble whine mutter murmur</h3>
</div>
<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> is secondary to</h3>
</div>
<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> but otherwise</h3>
</div>
<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> not uncommon</h3>
</div>
<div id="outline-container-sec-17-5" class="outline-3">
<h3 id="sec-17-5"><span class="section-number-3">17.5</span> ineffective half-measures</h3>
</div>
<div id="outline-container-sec-17-6" class="outline-3">
<h3 id="sec-17-6"><span class="section-number-3">17.6</span> if it were not for</h3>
</div>
<div id="outline-container-sec-17-7" class="outline-3">
<h3 id="sec-17-7"><span class="section-number-3">17.7</span> in fact quite the oppsite</h3>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Sleeping on the Job</h2>
<div class="outline-text-2" id="text-18">
<p>
<a href="http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work">http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work</a>
Sleeping on the job boosts productivity.
Siestas company policy.
Daytime drowsiness can affect mood, productivity, and creativity, but a brief nap may provide greater alertness for several hours to help improve attention, concentration and accuracy.
Napping perk.
Cardiovascular disease and depression.
Sleep-deprived workers.
Stretching out.
Dozing in your cubicle.
Fool passersby into thinking you’re hard at work.
Drool on your report.
Our inner body clocks start to make us feel drowsy around siesta time—or somewhere between 1 and 4 p.m.—so aim to fit in a nap during these hours.
Make quick naps a daily ritual.
Get into the sleep mindset.
Doze off.
Snooze.
Catnaps.
Avoid snoozing too long and waking up groggy.
Longer naps have the downside of greater sleep inertia.
Set your cell phone or another device to go off after about 15 minutes.
You’ll feel recharged enough to tackle your afternoon agenda and still hit the gym after work.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gu Feng</p>
<p class="date">Created: 2014-10-17 Fri 00:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.93.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
